<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="conv_lstm2d_input" type="Parameter" version="opset1">
			<data shape="1,25,64,64,3" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="conv_lstm2d_input">
					<dim>1</dim>
					<dim>25</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_2358" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="sequential_1/conv_lstm2d_3/time" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" names="sequential_1/conv_lstm2d_3/time,sequential_1/conv_lstm2d_3/time:0" />
			</output>
		</layer>
		<layer id="3" name="Constant_1699" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="4" name="sequential_1/conv_lstm2d_2/time" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" names="sequential_1/conv_lstm2d_2/time,sequential_1/conv_lstm2d_2/time:0" />
			</output>
		</layer>
		<layer id="5" name="Constant_1059" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="6" name="sequential_1/conv_lstm2d_1/time" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" names="sequential_1/conv_lstm2d_1/time,sequential_1/conv_lstm2d_1/time:0" />
			</output>
		</layer>
		<layer id="7" name="Constant_467" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="8" name="sequential_1/conv_lstm2d/time" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" names="sequential_1/conv_lstm2d/time,sequential_1/conv_lstm2d/time:0" />
			</output>
		</layer>
		<layer id="9" name="sequential_1/conv_lstm2d/transpose/perm" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="8" size="20" />
			<output>
				<port id="0" precision="I32" names="sequential_1/conv_lstm2d/transpose/perm,sequential_1/conv_lstm2d/transpose/perm:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="sequential_1/conv_lstm2d/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>25</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_1/conv_lstm2d/transpose,sequential_1/conv_lstm2d/transpose:0">
					<dim>25</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="sequential_1/conv_lstm2d/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>25</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="sequential_1/conv_lstm2d/Shape,sequential_1/conv_lstm2d/Shape:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="sequential_1/conv_lstm2d/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" names="sequential_1/conv_lstm2d/strided_slice/stack,sequential_1/conv_lstm2d/strided_slice/stack:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="sequential_1/conv_lstm2d/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="28" size="4" />
			<output>
				<port id="0" precision="I32" names="sequential_1/conv_lstm2d/strided_slice/stack_1,sequential_1/conv_lstm2d/strided_slice/stack_1:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="sequential_1/conv_lstm2d/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="28" size="4" />
			<output>
				<port id="0" precision="I32" names="sequential_1/conv_lstm2d/strided_slice/stack_2,sequential_1/conv_lstm2d/strided_slice/stack_2:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="sequential_1/conv_lstm2d/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" />
			<input>
				<port id="0" precision="I32">
					<dim>5</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="sequential_1/conv_lstm2d/strided_slice,sequential_1/conv_lstm2d/strided_slice:0" />
			</output>
		</layer>
		<layer id="16" name="sequential_1/conv_lstm2d/while/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="BOOL" />
			</output>
		</layer>
		<layer id="17" name="sequential_1/conv_lstm2d/while/loop_counter" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" names="sequential_1/conv_lstm2d/while/loop_counter,sequential_1/conv_lstm2d/while/loop_counter:0" />
			</output>
		</layer>
		<layer id="18" name="sequential_1/conv_lstm2d/while/maximum_iterations" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" names="sequential_1/conv_lstm2d/while/maximum_iterations,sequential_1/conv_lstm2d/while/maximum_iterations:0" />
			</output>
		</layer>
		<layer id="19" name="sequential_1/conv_lstm2d/TensorArrayV2_1" type="Const" version="opset1">
			<data element_type="f32" shape="0, 0" offset="32" size="1" />
			<output>
				<port id="0" precision="FP32" names="sequential_1/conv_lstm2d/TensorArrayV2_1,sequential_1/conv_lstm2d/TensorArrayV2_1:0">
					<dim>0</dim>
					<dim>0</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_72_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="33" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="21" name="Constant_72" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="22" name="Constant_74" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="28" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="ShapeOf_71" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>25</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Concat_75" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Broadcast_76" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I32">
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>25</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_9569" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="35" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Squeeze_9570" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>25</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>25</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_9576" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="43" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ReduceSum_9577" type="ReduceSum" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>25</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_9578" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="51" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Transpose_82" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_1/conv_lstm2d/Sum,sequential_1/conv_lstm2d/Sum:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Transpose_84_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 3, 3, 3" offset="83" size="216" />
			<output>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Transpose_84" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Convolution_85" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>62</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_86" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="299" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="sequential_1/conv_lstm2d/convolution" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>62</dim>
					<dim>62</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_1/conv_lstm2d/convolution,sequential_1/conv_lstm2d/convolution:0">
					<dim>1</dim>
					<dim>62</dim>
					<dim>62</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="conv_lstm2d/kernel_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 3, 3, 16" offset="331" size="864" />
			<output>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv_lstm2d/kernel" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv_lstm2d/kernel,conv_lstm2d/kernel:0,sequential_1/conv_lstm2d/split/ReadVariableOp,sequential_1/conv_lstm2d/split/ReadVariableOp:0,sequential_1_conv_lstm2d_split_readvariableop_resource,sequential_1_conv_lstm2d_split_readvariableop_resource:0,unknown,unknown:0">
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv_lstm2d/recurrent_kernel_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 3, 4, 16" offset="1195" size="1152" />
			<output>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv_lstm2d/recurrent_kernel" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv_lstm2d/recurrent_kernel,conv_lstm2d/recurrent_kernel:0,sequential_1/conv_lstm2d/split_1/ReadVariableOp,sequential_1/conv_lstm2d/split_1/ReadVariableOp:0,sequential_1_conv_lstm2d_split_1_readvariableop_resource,sequential_1_conv_lstm2d_split_1_readvariableop_resource:0,unknown_0,unknown_0:0">
					<dim>3</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv_lstm2d/bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16" offset="2347" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv_lstm2d/bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv_lstm2d/bias,conv_lstm2d/bias:0,sequential_1/conv_lstm2d/split_2/ReadVariableOp,sequential_1/conv_lstm2d/split_2/ReadVariableOp:0,sequential_1_conv_lstm2d_split_2_readvariableop_resource,sequential_1_conv_lstm2d_split_2_readvariableop_resource:0,unknown_1,unknown_1:0">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="sequential_1/conv_lstm2d/while" type="Loop" version="opset5">
			<port_map>
				<input external_port_id="2" internal_layer_id="10" />
				<input external_port_id="3" internal_layer_id="9" />
				<input external_port_id="4" internal_layer_id="8" />
				<input external_port_id="5" internal_layer_id="7" />
				<input external_port_id="6" internal_layer_id="6" />
				<input external_port_id="7" internal_layer_id="5" />
				<input external_port_id="8" internal_layer_id="4" />
				<input external_port_id="9" internal_layer_id="3" />
				<input external_port_id="10" internal_layer_id="2" />
				<input external_port_id="11" internal_layer_id="1" />
				<input external_port_id="12" internal_layer_id="0" />
				<output external_port_id="13" internal_layer_id="140" />
				<output external_port_id="-1" internal_layer_id="14" purpose="execution_condition" />
			</port_map>
			<back_edges>
				<edge from-layer="145" to-layer="10" />
				<edge from-layer="142" to-layer="9" />
				<edge from-layer="141" to-layer="8" />
				<edge from-layer="140" to-layer="7" />
				<edge from-layer="117" to-layer="6" />
				<edge from-layer="94" to-layer="5" />
				<edge from-layer="19" to-layer="4" />
				<edge from-layer="18" to-layer="3" />
				<edge from-layer="17" to-layer="2" />
				<edge from-layer="16" to-layer="1" />
				<edge from-layer="15" to-layer="0" />
			</back_edges>
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="BOOL" />
				<port id="2" precision="I32" />
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
				<port id="5" precision="FP32">
					<dim>0</dim>
					<dim>0</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>62</dim>
					<dim>62</dim>
					<dim>4</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>62</dim>
					<dim>62</dim>
					<dim>4</dim>
				</port>
				<port id="8" precision="I32" />
				<port id="9" precision="FP32">
					<dim>25</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
				<port id="10" precision="FP32">
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>16</dim>
				</port>
				<port id="11" precision="FP32">
					<dim>3</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
				<port id="12" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="13" precision="FP32" names="sequential_1/conv_lstm2d/while:3">
					<dim>-1</dim>
					<dim>15376</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="10" name="sequential_1_conv_lstm2d_while_sequential_1_conv_lstm2d_while_loop_counter" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1_conv_lstm2d_while_sequential_1_conv_lstm2d_while_loop_counter" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="9" name="sequential_1_conv_lstm2d_while_sequential_1_conv_lstm2d_while_maximum_iterations" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1_conv_lstm2d_while_sequential_1_conv_lstm2d_while_maximum_iterations" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="8" name="sequential_1_conv_lstm2d_while_placeholder" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1_conv_lstm2d_while_placeholder" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="7" name="sequential_1_conv_lstm2d_while_placeholder_1" type="Parameter" version="opset1">
						<data shape="?,?" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1_conv_lstm2d_while_placeholder_1" />
							<attribute name="old_api_map_element_type" version="0" value="f16" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="sequential_1_conv_lstm2d_while_placeholder_2" type="Parameter" version="opset1">
						<data shape="1,62,62,4" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1_conv_lstm2d_while_placeholder_2" />
							<attribute name="old_api_map_element_type" version="0" value="f16" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>62</dim>
								<dim>62</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="sequential_1_conv_lstm2d_while_placeholder_3" type="Parameter" version="opset1">
						<data shape="1,62,62,4" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1_conv_lstm2d_while_placeholder_3" />
							<attribute name="old_api_map_element_type" version="0" value="f16" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>62</dim>
								<dim>62</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="sequential_1_conv_lstm2d_while_sequential_1_conv_lstm2d_strided_slice_0" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1_conv_lstm2d_while_sequential_1_conv_lstm2d_strided_slice_0" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="3" name="sequential_1_conv_lstm2d_while_tensorarrayv2read_tensorlistgetitem_sequential_1_conv_lstm2d_tensorarrayunstack_tensorlistfromtensor_0" type="Parameter" version="opset1">
						<data shape="25,1,64,64,3" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1_conv_lstm2d_while_tensorarrayv2read_tensorlistgetitem_sequential_1_conv_lstm2d_tensorarrayunstack_tensorlistfromtensor_0" />
							<attribute name="old_api_map_element_type" version="0" value="f16" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>25</dim>
								<dim>1</dim>
								<dim>64</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="sequential_1_conv_lstm2d_while_split_readvariableop_resource_0" type="Parameter" version="opset1">
						<data shape="3,3,3,16" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1_conv_lstm2d_while_split_readvariableop_resource_0" />
							<attribute name="old_api_map_element_type" version="0" value="f16" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>3</dim>
								<dim>3</dim>
								<dim>3</dim>
								<dim>16</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="sequential_1_conv_lstm2d_while_split_1_readvariableop_resource_0" type="Parameter" version="opset1">
						<data shape="3,3,4,16" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1_conv_lstm2d_while_split_1_readvariableop_resource_0" />
							<attribute name="old_api_map_element_type" version="0" value="f16" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>3</dim>
								<dim>3</dim>
								<dim>4</dim>
								<dim>16</dim>
							</port>
						</output>
					</layer>
					<layer id="0" name="sequential_1_conv_lstm2d_while_split_2_readvariableop_resource_0" type="Parameter" version="opset1">
						<data shape="16" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_7088, sequential_1_conv_lstm2d_while_split_2_readvariableop_resource_0" />
							<attribute name="old_api_map_element_type" version="0" value="f16" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>16</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="sequential_1/conv_lstm2d/while/add_8/y" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="28" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1/conv_lstm2d/while/add_8/y" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="12" name="sequential_1/conv_lstm2d/while/add_8" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1/conv_lstm2d/while/add_8" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="I32" />
						</output>
					</layer>
					<layer id="13" name="sequential_1/conv_lstm2d/while/Less" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1/conv_lstm2d/while/Less" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="20" name="Constant_7051" type="Const" version="opset1">
						<data element_type="i64" shape="5" offset="2379" size="40" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7051" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>5</dim>
							</port>
						</output>
					</layer>
					<layer id="21" name="Transpose_7052" type="Transpose" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_7052" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>25</dim>
								<dim>1</dim>
								<dim>64</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I64">
								<dim>5</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>25</dim>
								<dim>1</dim>
								<dim>3</dim>
								<dim>64</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="22" name="Squeeze_155" type="Squeeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Squeeze_155, Squeeze_251" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
						<output>
							<port id="1" precision="I32" />
						</output>
					</layer>
					<layer id="23" name="Constant_7049" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7049" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="24" name="Transpose_7047" type="Gather" version="opset8">
						<data batch_dims="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_160, Transpose_7047" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>25</dim>
								<dim>1</dim>
								<dim>3</dim>
								<dim>64</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="I32" />
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="3" precision="FP32">
								<dim>1</dim>
								<dim>3</dim>
								<dim>64</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="25" name="Constant_7053" type="Const" version="opset1">
						<data element_type="i64" shape="4" offset="2419" size="32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7053" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="26" name="Transpose_7054" type="Transpose" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_7054" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>3</dim>
								<dim>3</dim>
								<dim>3</dim>
								<dim>16</dim>
							</port>
							<port id="1" precision="I64">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>16</dim>
								<dim>3</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="27" name="Constant_7055" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7055" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="28" name="Transpose_184" type="Split" version="opset1">
						<data num_splits="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_184" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>16</dim>
								<dim>3</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
							<port id="3" precision="FP32">
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
							<port id="4" precision="FP32">
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
							<port id="5" precision="FP32">
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="29" name="Convolution_211" type="Convolution" version="opset1">
						<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Convolution_211" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>3</dim>
								<dim>64</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="30" name="Constant_7089" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7089" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="31" name="Transpose_7069" type="Split" version="opset1">
						<data num_splits="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_7069" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>16</dim>
							</port>
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>4</dim>
							</port>
							<port id="3" precision="FP32">
								<dim>4</dim>
							</port>
							<port id="4" precision="FP32">
								<dim>4</dim>
							</port>
							<port id="5" precision="FP32">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="32" name="Constant_7059" type="Const" version="opset1">
						<data element_type="i64" shape="3" offset="2451" size="24" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7059" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="33" name="Transpose_5780" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5780" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>4</dim>
							</port>
							<port id="1" precision="I64">
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="34" name="Transpose_5782" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5782" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="35" name="Constant_7060" type="Const" version="opset1">
						<data element_type="i64" shape="4" offset="51" size="32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7060" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="36" name="Transpose_7061" type="Transpose" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_7061" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>62</dim>
								<dim>62</dim>
								<dim>4</dim>
							</port>
							<port id="1" precision="I64">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="37" name="sequential_1/conv_lstm2d/while/ones_like/Const_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="" offset="2475" size="2" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1/conv_lstm2d/while/ones_like/Const" />
						</rt_info>
						<output>
							<port id="0" precision="FP16" />
						</output>
					</layer>
					<layer id="38" name="sequential_1/conv_lstm2d/while/ones_like/Const" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
							<attribute name="fused_names" version="0" value="sequential_1/conv_lstm2d/while/ones_like/Const" />
						</rt_info>
						<input>
							<port id="0" precision="FP16" />
						</input>
						<output>
							<port id="1" precision="FP32" />
						</output>
					</layer>
					<layer id="39" name="sequential_1/conv_lstm2d/while/ones_like/Shape" type="ShapeOf" version="opset3">
						<data output_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1/conv_lstm2d/while/ones_like/Shape" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>62</dim>
								<dim>62</dim>
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="I32">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="40" name="sequential_1/conv_lstm2d/while/ones_like" type="Broadcast" version="opset3">
						<data mode="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sequential_1/conv_lstm2d/while/ones_like" />
						</rt_info>
						<input>
							<port id="0" precision="FP32" />
							<port id="1" precision="I32">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>62</dim>
								<dim>62</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="41" name="Constant_7062" type="Const" version="opset1">
						<data element_type="i64" shape="4" offset="51" size="32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7062" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="42" name="Transpose_7063" type="Transpose" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_7063" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>62</dim>
								<dim>62</dim>
								<dim>4</dim>
							</port>
							<port id="1" precision="I64">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="43" name="Transpose_201" type="Multiply" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_201" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="44" name="Constant_7064" type="Const" version="opset1">
						<data element_type="i64" shape="4" offset="2419" size="32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7064" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="45" name="Transpose_7065" type="Transpose" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_7065" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>3</dim>
								<dim>3</dim>
								<dim>4</dim>
								<dim>16</dim>
							</port>
							<port id="1" precision="I64">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>16</dim>
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="46" name="Constant_7066" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7066" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="47" name="Transpose_177" type="Split" version="opset1">
						<data num_splits="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_177" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>16</dim>
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>4</dim>
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
							<port id="3" precision="FP32">
								<dim>4</dim>
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
							<port id="4" precision="FP32">
								<dim>4</dim>
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
							<port id="5" precision="FP32">
								<dim>4</dim>
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="48" name="Convolution_204" type="Convolution" version="opset1">
						<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Convolution_204" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>4</dim>
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="49" name="Transpose_5786" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5786" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="50" name="Transpose_5790_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="1, 1, 1, 1" offset="2477" size="2" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5790" />
						</rt_info>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="51" name="Transpose_5790" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
							<attribute name="fused_names" version="0" value="Transpose_5790" />
						</rt_info>
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="52" name="Transpose_5792" type="Multiply" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5792" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="53" name="Transpose_5796_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="1, 1, 1, 1" offset="2479" size="2" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5796" />
						</rt_info>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="54" name="Transpose_5796" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
							<attribute name="fused_names" version="0" value="Transpose_5796" />
						</rt_info>
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="55" name="Transpose_5798" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5798" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="56" name="Transpose_5810" type="Clamp" version="opset1">
						<data min="0" max="1" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5804, Transpose_5810" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="57" name="Constant_5811" type="Const" version="opset1">
						<data element_type="i64" shape="4" offset="51" size="32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_5811" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="58" name="Transpose_5812" type="Transpose" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5812" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>62</dim>
								<dim>62</dim>
								<dim>4</dim>
							</port>
							<port id="1" precision="I64">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="59" name="Transpose_5814" type="Multiply" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5814" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="60" name="Convolution_185" type="Convolution" version="opset1">
						<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Convolution_185" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>3</dim>
								<dim>64</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>4</dim>
								<dim>3</dim>
								<dim>3</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>62</dim>
								<dim>62</dim>
							</port>
						</output>
					</layer>
					<layer id="61" name="Constant_7070" type="Const" version="opset1">
						<data element_type="i64" shape="3" offset="2451" size="24" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7070" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="62" name="Transpose_5818" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Transpose_5818" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>4</dim>
							</port>
							<port id="1" precision="I64">
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>4</dim>
								<dim>1</dim>
